// Lab_03_1
// Гринчук Тарас
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант №4

// Ініціалізуємо змінні
let y, x;

// Отримуємо значення x
x = parseInt(prompt("Введіть значення x:"));

// Записуєм значення для y та викликаємо функцію
y = 1 + x + chooseOption(x);

// Функція яка повертає вираз в залежності від значення x
function chooseOption(x) {
   // Перший спосіб (використання лише команд розгалуження в скороченій формі)
   if (x <= 4) {
      return Math.exp(1) ** Math.log(2 + 2 * x) + 2 * x;
   }
   if (4 < x && x <= 7) {
      return 1 / Math.tan((1 + x) / 9) + 8 * x;
   }
   if (x > 7) {
      return 1 - 7 * x + x ** 2 - 2 * x ** 3;
   }
   // Другий спосіб (використання лише команд розгалуження в повній формі)
   /*
   if (x <= 4) {
      return Math.exp(1) ** Math.log(2 + 2 * x) + 2 * x;
   } else if (4 < x <= 7) {
      return 1 / Math.tan((1 + x) / 9) + 8 * x;
   } else {
      return 1 - 7 * x + x ** 2 - 2 * x ** 3;
   }
   */
}

alert(`Значення змінної y дорівнює ${y}`); // Виводимо значення y
